In [9]:
import pandas as pd
data=pd.read_csv('student.csv')
data

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [10]:
data['marks'].mean()

64.499

In [11]:
data['age'].max()

23

In [12]:
data.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [14]:
data.isnull().sum()

roll     0
name     0
class    0
marks    0
age      0
dtype: int64

In [17]:
data.iloc[7,3]

68.33

In [16]:
data.dropna()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [18]:
data.fillna(0)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [19]:
data.fillna(method='backfill')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [20]:
data['marks'].fillna(data['marks'].median())

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [21]:
data['class'].mode()[0]

'BE'

In [23]:
data['class'].fillna(data['class'].mode()[0])

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object

In [32]:
data=pd.read_csv('Social_Network_Ads.csv')

In [33]:
data.shape

(400, 5)

In [34]:
data.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [41]:
X=data[['Age','EstimatedSalary']]
y=data['Purchased']
len(X)

400

In [42]:
X.head()

    Age  EstimatedSalary
0  19.0          19000.0
1  35.0          20000.0
2  26.0          43000.0
3  27.0          57000.0
4  19.0          76000.0

In [43]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=0)

In [44]:
len(X_train)

300

In [45]:
len(X_test)

100

In [46]:
X_train.head()

      Age  EstimatedSalary
250  44.0          39000.0
63   32.0         120000.0
312  38.0          50000.0
159  32.0         135000.0
283  52.0          21000.0

In [47]:
y_train.head()

250    0
63     1
312    0
159    1
283    1
Name: Purchased, dtype: int64

In [50]:
X.std()

Age                   10.482877
EstimatedSalary    34096.960282
dtype: float64

In [51]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
X_scaled=scaler.fit_transform(X)

In [53]:
pd.DataFrame(X_scaled).std()

0    1.001252
1    1.001252
dtype: float64

In [57]:
X.describe()

              Age  EstimatedSalary
count  400.000000       400.000000
mean    37.655000     69742.500000
std     10.482877     34096.960282
min     18.000000     15000.000000
25%     29.750000     43000.000000
50%     37.000000     70000.000000
75%     46.000000     88000.000000
max     60.000000    150000.000000

In [58]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler()
X_scaled=scaler.fit_transform(X)
pd.DataFrame(X_scaled).describe()

                0           1
count  400.000000  400.000000
mean     0.467976    0.405500
std      0.249592    0.252570
min      0.000000    0.000000
25%      0.279762    0.207407
50%      0.452381    0.407407
75%      0.666667    0.540741
max      1.000000    1.000000

In [62]:
#Binarization
from sklearn.preprocessing import Binarizer
bin=Binarizer(threshold=30)
X_scaled=bin.fit_transform(X)
pd.DataFrame(X_scaled).head(10)

     0    1
0  0.0  1.0
1  1.0  1.0
2  0.0  1.0
3  0.0  1.0
4  0.0  1.0
5  0.0  1.0
6  0.0  1.0
7  1.0  1.0
8  0.0  1.0
9  1.0  1.0

In [64]:
data=pd.read_csv('student.csv')
data

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [66]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
data['name']=le.fit_transform(data['name'])
data

   roll  name class  marks  age
0     1     6    TE  56.77   22
1     2     2    TE  59.77   21
2     3     5    BE  76.88   19
3     4     0    TE  69.66   20
4     5     8    TE  63.28   21
5     6     9    BE  49.55   22
6     7     1    BE  65.34   19
7     8     3    BE  58.55   23
8     9     4    TE  56.75   20
9    10     7    BE  78.66   21

In [67]:
data=pd.read_csv('student.csv')
data_encoded=pd.get_dummies(data)
data_encoded.head()

,roll,marks,age,name_ajinkya,name_amar,name_amit,name_amita,name_amol,name_aniket,name_anil,name_anmol,name_asha,name_ayesha,class_BE,class_TE
0,1,56.77,22,0,0,0,0,0,0,1,0,0,0,0,1
1,2,59.77,21,0,0,1,0,0,0,0,0,0,0,0,1
2,3,76.88,19,0,0,0,0,0,1,0,0,0,0,1,0
3,4,69.66,20,1,0,0,0,0,0,0,0,0,0,0,1
4,5,63.28,21,0,0,0,0,0,0,0,0,1,0,0,1

In [68]:
data_encoded.shape

(10, 15)

In [2]:
X=[['marks','age']]
y=['class_BE','class_TE']